---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopsOutsideFaceSplit
source: html/0f7e6366-89d2-8e0c-89c1-13ffd8059478.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LoopsOutsideFaceSplit Property

Some of the lines drawn lie outside of the boundary of the face being split. All lines used to split a face must be contained
 within the face being split and cannot intersect or overlap any of the boundaries of that face.

## Syntax (C#)
```csharp
public static FailureDefinitionId LoopsOutsideFaceSplit { get; }
```